[
  {
    "notebook": "15_More_Files.ipynb",
    "chapter_index": "Advanced File Handling - With Statement (Advanced)",
    "exercise_number": 1,
    "difficulty": "intermediate",
    "exercise": "Write a function that uses a with statement to replace all occurrences of a specific word in a text file with another word. The function should take the filename, the word to replace, and the replacement word as parameters."
  },
  {
    "notebook": "15_More_Files.ipynb",
    "chapter_index": "Advanced File Handling - With Statement (Advanced)",
    "exercise_number": 2,
    "difficulty": "intermediate",
    "exercise": "Create a function that uses the with statement to merge the contents of two text files into a third file, alternating lines from each source file. Handle cases where one file might be longer than the other."
  },
  {
    "notebook": "15_More_Files.ipynb",
    "chapter_index": "Advanced File Handling - With Statement (Advanced)",
    "exercise_number": 3,
    "difficulty": "intermediate",
    "exercise": "Use the with statement with multiple file handlers in a single statement to open three files simultaneously: two for reading and one for writing. Combine the contents of the first two files and write the result to the third."
  },
  {
    "notebook": "15_More_Files.ipynb",
    "chapter_index": "Advanced File Handling - With Statement (Advanced)",
    "exercise_number": 4,
    "difficulty": "intermediate",
    "exercise": "Create a simple file backup system using the with statement. Write a function that copies the contents of a file to a new file with a '.bak' extension, preserving the original file."
  },
  {
    "notebook": "15_More_Files.ipynb",
    "chapter_index": "Advanced File Handling - With Statement (Advanced)",
    "exercise_number": 5,
    "difficulty": "advanced",
    "exercise": "Implement a context manager class called 'TempFileManager' that creates a temporary file when entered and automatically deletes it when exited. Use this with the with statement to perform temporary file operations."
  },
  {
    "notebook": "15_More_Files.ipynb",
    "chapter_index": "Advanced File Handling - With Statement (Advanced)",
    "exercise_number": 6,
    "difficulty": "advanced",
    "exercise": "Write a program that uses the with statement to read a CSV file with employee data, performs calculations (like computing average salary), and writes the results to another file. Include proper error handling for file operations and data processing."
  },
  {
    "notebook": "15_More_Files.ipynb",
    "chapter_index": "Advanced File Handling - With Statement (Advanced)",
    "exercise_number": 7,
    "difficulty": "advanced",
    "exercise": "Create a program that uses the with statement to read a file line by line in chunks of N lines at a time. Process each chunk and write the results to an output file, without loading the entire file into memory at once."
  },
  {
    "notebook": "15_More_Files.ipynb",
    "chapter_index": "Advanced File Handling - With Statement (Advanced)",
    "exercise_number": 8,
    "difficulty": "advanced",
    "exercise": "Implement a file encryption/decryption tool using the with statement. The tool should read a file, apply a simple encryption algorithm (like a Caesar cipher), and write the encrypted content to a new file."
  },
  {
    "notebook": "15_More_Files.ipynb",
    "chapter_index": "Advanced File Handling - With Statement (Advanced)",
    "exercise_number": 9,
    "difficulty": "advanced",
    "exercise": "Create a custom context manager that tracks the time spent on file operations. Use this with the with statement to measure how long it takes to read from and write to files of different sizes."
  },
  {
    "notebook": "15_More_Files.ipynb",
    "chapter_index": "Advanced File Handling - With Statement (Advanced)",
    "exercise_number": 10,
    "difficulty": "advanced",
    "exercise": "Build a file versioning system that uses the with statement to read a file, update its content, and save the changes while keeping a backup of previous versions. Each time the file is modified, create a new version with a timestamp in the filename."
  }
] 